//
//  StaticTexts.swift
//  OldHymns
//
//  Created by JooYoung Kim on 10/2/25.
//

// StaticTexts.swift
import Foundation

enum StaticTexts {
    static let lordsPrayer = """
하늘에 계신 우리 아버지여,
이름이 거룩히 여김을 받으시오며, 나라이 임하옵시며,
뜻이 하늘에서 이룬 것같이 땅에서도 이루어지이다.
오늘날 우리에게 일용할 양식을 주옵시고,
우리가 우리에게  죄 지은 자를 사하여 준 것같이
우리 죄를 사하여 주옵시고,
우리를 시험에 들게 하지 마옵시고, 다만 악에서 구하옵소서.
대개 나라와 권세와 영광이, 아버지께 영원히 있사옵나이다.

아멘
"""
    
    static let apostlesCreed = """
전능하사 천지를 만드신 하나님 아버지를 내가 믿사오며,
그 외아들 우리 주 예수 그리스도를 믿사오니,
이는 성령으로 잉태하사 동정녀 마리아에게 나시고,
본디오 빌라도에게 고난을 받으사, 십자가에 못 박혀 죽으시고,
장사한지 사흘 만에 죽은자 가운데서 다시 살아나시며,
하늘에 오르사 전능하신 하나님 우편에 앉아 계시다가,
저리로서 산 자와 죽은 자를 심판하러 오시리라.
성령을 믿사오며,거룩한 공회와 성도가 서로 교통하는 것과
죄를 사하여 주시는 것과 몸이 다시 사는 것과
영원히 사는 것을 믿사옵나이다.

아멘
"""
    
    static let tenCommandments = """
&nbsp;&nbsp;하나님이 이 모든 말씀으로 일러 가라사대 나는 너를 앱굽 땅, 종 되었던 집에서 인도하여 낸 너의 하나님 여호와로라.<br>
<br>
<font color="#000080"><b>제일은, 너는 나 외에는 다른 신들을 네게 있게 말지니라.</b></font><br>
<br>
<font color="#000080"><b>제이는, 너를 위하여 새긴 우상을 만들지 말고 또 위로 하늘에. 있는 것이나, 아래로 땅에 있는 것이나, 땅 아래 물 속에 있는 것의 아무 형상이든지 만들지 말며, 그것들에게 절하지 말며, 그것들을 섬기지 말라.</b></font><br>
&nbsp;&nbsp;나 여호와 너의 하나님은 질투하는 하나님인즉 나를 미원하는 자의 죄를 갚되, 아비로부터 아들에게로 삼사 대까지 이르게 하거니와,<br>
나를 사랑하고 내 계명을 지키는 자에게는 천 대까지 은혜를 배푸느니라.<br>
<br>
<font color="#000080"><b>제삼은, 너는 너의 하나님 영호와의 이름을 망령되이 일컫지 말라.</b></font><br>
&nbsp;&nbsp;나 여호와는 나의 이름을 망령되이 일컫는 자를 죄 없다 하지 아니하리라.<br>
<br>
<font color="#000080"><b>제사는, 안식일을 기억하여 거룩히 지키라.</b></font><br>
&nbsp;엿새 동안은 힘써 네 모든 일을 행할 것이나, 제 칠일은 너의 하나님 여호와의 안식일인즉 너나 네 아들이나, 네 딸이나, 네 남종이나, 네 여종이나, 네 육축이나, 네 문안에 유하는 객이라도 아무 일도 하지 말라.<br>
&nbsp;&nbsp;이는 엿새 동안에 나 여호와가 하늘과 땅과 바다와, 그 가운데 모든 것을 만들고 체 칠일에 쉬었음이라.<br>
&nbsp;&nbsp;그러므로 나 여호와가 안식일을 복되게 하여, 그 날을 거룩하게 하였느니라.<br>
<br>
<font color="#000080"><b>제오는, 네 부모를 공경하라.</b></font><br>
&nbsp;&nbsp;그리하면 너의 하나님 나 여호와가 네게 준 땅에서 네 생명이 길리라.<br>
<br>
<font color="#000080"><b>제육은, 살인하지 말지니라.</b></font><br>
<br>
<font color="#000080"><b>제칠은, 간음하지 말지니라.</b></font><br>
<br>
<font color="#000080"><b>제팔은, 도적질하지 말지니라.</b></font><br>
<br>
<font color="#000080"><b>제구는, 네 이웃에 대하여 거짓 증거하지 말지니라.</b></font><br>
<br>
<font color="#000080"><b>제십은, 네 이웃의 집을 탐내지 말지니라.</b></font><br>
&nbsp;&nbsp;네 이웃의 아내나, 그의 남종이나 그의 여종이나,그의 소나 그의 나귀나, 무릇 네 이웃의 소유를 탐내지 말지니라.<br>
 (출애굽기 20 : 1-17)<br>
<br>
&nbsp;&nbsp;예수께서 가라사대, 내 마음을 다하고 목숨을 다하고 뜻을 다하여 주 너의 하나님을 사랑하라 하셨으니, 이것이 크고 첫째 되는 계명이요, 
둘째는 그와 같으니, 네 이웃을 네 몸과 같이 사랑하라 하셨으니, 이 두 계명이 온 율법과 선지자의 강령이니라.<br>
 (마태복음 22 : 37-40)
"""
}
